In [1]:
import pandas as pd
import numpy as np

In [2]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), 
                  columns=cols)
df

    A   B   C   D   E
0  18   8   3  15  12
1   5   5  19   2   5
2   6  18  11   4   7
3   1  15   6  12   6
4  19  11  14   2  16

In [3]:
# akses nilai variabel pada query()
df.query('A > 10')

    A   B   C   D   E
0  18   8   3  15  12
4  19  11  14   2  16

In [4]:
rerata = df['A'].mean()
rerata

9.8

In [5]:
df.query('A > @rerata')

    A   B   C   D   E
0  18   8   3  15  12
4  19  11  14   2  16